<template>
  <div id="help">
    <b-button @click="closeHelp">Назад</b-button>
    <div class="container">
      <p>
        1. Для того, чтобы добавить строку или колонку, необходимо выбрать “Редактор” в меню баре.
      </p>
      <p>
        2. При добавлении колонки необходимо выбрать название колонки, что будет являться конечной папкой, в которой будут сканироваться файлы. При необходимости можно ввести текст подсказки, который будет виден при наведении курсора на колонку.
      </p>
      <p>
        3. При добавлении строки необходимо выбрать название строки, что будет являться названием стенда, название будет отображаться в первой колонке таблицы. В поле путь к папке указывается путь к папке стенда, в которой необходимо сканировать директории. При необходимости, можно добавить название дополнительных директорий, в которых нужно сканировать файлы, файлы в этих директориях будут отображаться в последней колонке “Доп”.
      </p>  
      <p>
        4. Для удаления или редактирования колонки необходимо навести курсор на нужную колонку и зафиксировать меню, нажав лкм на колонке.
      </p>  
      <p>
        5. Для удаления или редактирования строки необходимо нажать пкм на строке.
      </p>
    </div>
  </div>
</template>

<script>
export default {
  name: 'help',
  data() {
    return {};
  },
  mounted() {},
  methods: {
    closeHelp() {
      this.$router.push('/');
    },
  },
};
</script>
